day-02/blockMesh/cylinder_in_tank/case/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//convertToMeters 0.1;

// define vertices coordinates; start with number 0
// use jinja2 python lib to replace var tags with actual values
vertices
(
    (-5.32288 -3.50000 0.00000)	// v0
    (-1.32288 -3.50000 0.00000)	// v1
    (0.00000 -3.50000 0.00000)	// v2
    (1.32288 -3.50000 0.00000)	// v3
    (5.32288 -3.50000 0.00000)	// v4
    (-5.32288 -1.50000 0.00000)	// v5
    (-1.32288 -1.50000 0.00000)	// v6
    (0.00000 -2.00000 0.00000)	// v7
    (1.32288 -1.50000 0.00000)	// v8
    (5.32288 -1.50000 0.00000)	// v9
    (-5.32288 0.00000 0.00000)	// v10
    (-2.00000 0.00000 0.00000)	// v11
    (-0.50000 -0.07610 0.00000)	// v12
    (-0.25000 -0.12561 0.00000)	// v13
    (0.00000 -0.12021 0.00000)	// v14
    (0.25000 -0.10243 0.00000)	// v15
    (0.50000 -0.07610 0.00000)	// v16
    (0.25000 -0.04976 0.00000)	// v17
    (0.00000 -0.03198 0.00000)	// v18
    (-0.25000 -0.02659 0.00000)	// v19
    (2.00000 0.00000 0.00000)	// v20
    (5.32288 0.00000 0.00000)	// v21
    (-5.32288 1.50000 0.00000)	// v22
    (-1.32288 1.50000 0.00000)	// v23
    (0.00000 2.00000 0.00000)	// v24
    (1.32288 1.50000 0.00000)	// v25
    (5.32288 1.50000 0.00000)	// v26
    (-5.32288 3.50000 0.00000)	// v27
    (-1.32288 3.50000 0.00000)	// v28
    (0.00000 3.50000 0.00000)	// v29
    (1.32288 3.50000 0.00000)	// v30
    (5.32288 3.50000 0.00000)	// v31
    (-5.32288 -3.50000 0.20000)	// v32
    (-1.32288 -3.50000 0.20000)	// v33
    (0.00000 -3.50000 0.20000)	// v34
    (1.32288 -3.50000 0.20000)	// v35
    (5.32288 -3.50000 0.20000)	// v36
    (-5.32288 -1.50000 0.20000)	// v37
    (-1.32288 -1.50000 0.20000)	// v38
    (0.00000 -2.00000 0.20000)	// v39
    (1.32288 -1.50000 0.20000)	// v40
    (5.32288 -1.50000 0.20000)	// v41
    (-5.32288 0.00000 0.20000)	// v42
    (-2.00000 0.00000 0.20000)	// v43
    (-0.50000 -0.07610 0.20000)	// v44
    (-0.25000 -0.12561 0.20000)	// v45
    (0.00000 -0.12021 0.20000)	// v46
    (0.25000 -0.10243 0.20000)	// v47
    (0.50000 -0.07610 0.20000)	// v48
    (0.25000 -0.04976 0.20000)	// v49
    (0.00000 -0.03198 0.20000)	// v50
    (-0.25000 -0.02659 0.20000)	// v51
    (2.00000 0.00000 0.20000)	// v52
    (5.32288 0.00000 0.20000)	// v53
    (-5.32288 1.50000 0.20000)	// v54
    (-1.32288 1.50000 0.20000)	// v55
    (0.00000 2.00000 0.20000)	// v56
    (1.32288 1.50000 0.20000)	// v57
    (5.32288 1.50000 0.20000)	// v58
    (-5.32288 3.50000 0.20000)	// v59
    (-1.32288 3.50000 0.20000)	// v60
    (0.00000 3.50000 0.20000)	// v61
    (1.32288 3.50000 0.20000)	// v62
    (5.32288 3.50000 0.20000)	// v63
);

// Edges of foil boundary only, replace with spline
//	spline A B
//      ( 
//        (x1 y1 z1) - interpolacijske točke
//        (x2 y2 z2)
//        ...
//        (xn yn zn)
//     )
edges
(
    // inner circle
...
    spline 13 14 ( (-0.24932 -0.12562 0.00000) (-0.23598 -0.12586 0.00000) (-0.22195 -0.12602 0.00000) (-0.20720 -0.12610 0.00000) (-0.19168 -0.12610 0.00000) (-0.17536 -0.12600 0.00000) (-0.15819 -0.12580 0.00000) (-0.14013 -0.12548 0.00000) (-0.12114 -0.12505 0.00000) (-0.10116 -0.12449 0.00000) (-0.08015 -0.12379 0.00000) (-0.05805 -0.12294 0.00000) (-0.03480 -0.12193 0.00000) (-0.01035 -0.12075 0.00000) )
    spline 14 15 ( (0.01536 -0.11938 0.00000) (0.04241 -0.11782 0.00000) (0.07086 -0.11606 0.00000) (0.10079 -0.11407 0.00000) (0.13226 -0.11184 0.00000) (0.16536 -0.10937 0.00000) (0.20018 -0.10661 0.00000) (0.23680 -0.10357 0.00000) )
    spline 15 16 ( (0.27532 -0.10020 0.00000) (0.31584 -0.09648 0.00000) (0.35845 -0.09237 0.00000) (0.40327 -0.08782 0.00000) (0.45042 -0.08277 0.00000) )
    spline 16 17 ( (0.45042 0.08277 0.00000) (0.40327 0.08782 0.00000) (0.35845 0.09237 0.00000) (0.31584 0.09648 0.00000) (0.27532 0.10020 0.00000) )
    spline 17 18 ( (0.23680 0.10357 0.00000) (0.20018 0.10661 0.00000) (0.16536 0.10937 0.00000) (0.13226 0.11184 0.00000) (0.10079 0.11407 0.00000) (0.07086 0.11606 0.00000) (0.04241 0.11782 0.00000) (0.01536 0.11938 0.00000) )
    spline 18 19 ( (-0.01035 0.12075 0.00000) (-0.03480 0.12193 0.00000) (-0.05805 0.12294 0.00000) (-0.08015 0.12379 0.00000) (-0.10116 0.12449 0.00000) (-0.12114 0.12505 0.00000) (-0.14013 0.12548 0.00000) (-0.15819 0.12580 0.00000) (-0.17536 0.12600 0.00000) (-0.19168 0.12610 0.00000) (-0.20720 0.12610 0.00000) (-0.22195 0.12602 0.00000) (-0.23598 0.12586 0.00000) (-0.24932 0.12562 0.00000) )
    spline 19 12 ( (-0.26200 0.12532 0.00000) (-0.27406 0.12496 0.00000) (-0.28552 0.12454 0.00000) (-0.29642 0.12408 0.00000) (-0.30678 0.12357 0.00000) (-0.31663 0.12302 0.00000) (-0.32599 0.12244 0.00000) (-0.33490 0.12182 0.00000) (-0.34336 0.12118 0.00000) (-0.35141 0.12052 0.00000) (-0.35906 0.11983 0.00000) (-0.36634 0.11913 0.00000) (-0.37326 0.11841 0.00000) (-0.37983 0.11768 0.00000) (-0.38608 0.11694 0.00000) (-0.39203 0.11620 0.00000) (-0.39768 0.11544 0.00000) (-0.40305 0.11468 0.00000) (-0.40816 0.11392 0.00000) (-0.41302 0.11316 0.00000) (-0.41764 0.11239 0.00000) (-0.42203 0.11163 0.00000) (-0.42620 0.11087 0.00000) (-0.43017 0.11011 0.00000) (-0.43394 0.10936 0.00000) (-0.43753 0.10861 0.00000) (-0.44094 0.10787 0.00000) (-0.44419 0.10713 0.00000) (-0.44727 0.10639 0.00000) (-0.45020 0.10567 0.00000) (-0.45299 0.10495 0.00000) (-0.45564 0.10423 0.00000) (-0.45815 0.10353 0.00000) (-0.46055 0.10283 0.00000) (-0.46283 0.10214 0.00000) (-0.46499 0.10146 0.00000) (-0.46705 0.10078 0.00000) (-0.46901 0.10011 0.00000) (-0.47087 0.09945 0.00000) (-0.47264 0.09880 0.00000) (-0.47432 0.09815 0.00000) (-0.47592 0.09752 0.00000) (-0.47744 0.09688 0.00000) (-0.47888 0.09626 0.00000) (-0.48026 0.09564 0.00000) (-0.48156 0.09503 0.00000) (-0.48281 0.09443 0.00000) (-0.48399 0.09383 0.00000) (-0.48511 0.09323 0.00000) (-0.48618 0.09264 0.00000) (-0.48719 0.09206 0.00000) (-0.48816 0.09148 0.00000) (-0.48907 0.09090 0.00000) (-0.48995 0.09033 0.00000) (-0.49078 0.08976 0.00000) (-0.49156 0.08919 0.00000) (-0.49231 0.08862 0.00000) (-0.49303 0.08804 0.00000) (-0.49370 0.08747 0.00000) (-0.49435 0.08689 0.00000) (-0.49496 0.08631 0.00000) (-0.49554 0.08572 0.00000) (-0.49610 0.08512 0.00000) (-0.49662 0.08451 0.00000) (-0.49712 0.08388 0.00000) (-0.49760 0.08322 0.00000) (-0.49805 0.08253 0.00000) (-0.49848 0.08178 0.00000) (-0.49889 0.08097 0.00000) (-0.49928 0.08004 0.00000) (-0.49965 0.07886 0.00000) )
...
    spline 45 46 ( (-0.24932 -0.12562 0.20000) (-0.23598 -0.12586 0.20000) (-0.22195 -0.12602 0.20000) (-0.20720 -0.12610 0.20000) (-0.19168 -0.12610 0.20000) (-0.17536 -0.12600 0.20000) (-0.15819 -0.12580 0.20000) (-0.14013 -0.12548 0.20000) (-0.12114 -0.12505 0.20000) (-0.10116 -0.12449 0.20000) (-0.08015 -0.12379 0.20000) (-0.05805 -0.12294 0.20000) (-0.03480 -0.12193 0.20000) (-0.01035 -0.12075 0.20000) )
    spline 46 47 ( (0.01536 -0.11938 0.20000) (0.04241 -0.11782 0.20000) (0.07086 -0.11606 0.20000) (0.10079 -0.11407 0.20000) (0.13226 -0.11184 0.20000) (0.16536 -0.10937 0.20000) (0.20018 -0.10661 0.20000) (0.23680 -0.10357 0.20000) )
    spline 47 48 ( (0.27532 -0.10020 0.20000) (0.31584 -0.09648 0.20000) (0.35845 -0.09237 0.20000) (0.40327 -0.08782 0.20000) (0.45042 -0.08277 0.20000) )
    spline 48 49 ( (0.45042 0.08277 0.20000) (0.40327 0.08782 0.20000) (0.35845 0.09237 0.20000) (0.31584 0.09648 0.20000) (0.27532 0.10020 0.20000) )
    spline 49 50 ( (0.23680 0.10357 0.20000) (0.20018 0.10661 0.20000) (0.16536 0.10937 0.20000) (0.13226 0.11184 0.20000) (0.10079 0.11407 0.20000) (0.07086 0.11606 0.20000) (0.04241 0.11782 0.20000) (0.01536 0.11938 0.20000) )
    spline 50 51 ( (-0.01035 0.12075 0.20000) (-0.03480 0.12193 0.20000) (-0.05805 0.12294 0.20000) (-0.08015 0.12379 0.20000) (-0.10116 0.12449 0.20000) (-0.12114 0.12505 0.20000) (-0.14013 0.12548 0.20000) (-0.15819 0.12580 0.20000) (-0.17536 0.12600 0.20000) (-0.19168 0.12610 0.20000) (-0.20720 0.12610 0.20000) (-0.22195 0.12602 0.20000) (-0.23598 0.12586 0.20000) (-0.24932 0.12562 0.20000) )
    spline 51 44 ( (-0.26200 0.12532 0.20000) (-0.27406 0.12496 0.20000) (-0.28552 0.12454 0.20000) (-0.29642 0.12408 0.20000) (-0.30678 0.12357 0.20000) (-0.31663 0.12302 0.20000) (-0.32599 0.12244 0.20000) (-0.33490 0.12182 0.20000) (-0.34336 0.12118 0.20000) (-0.35141 0.12052 0.20000) (-0.35906 0.11983 0.20000) (-0.36634 0.11913 0.20000) (-0.37326 0.11841 0.20000) (-0.37983 0.11768 0.20000) (-0.38608 0.11694 0.20000) (-0.39203 0.11620 0.20000) (-0.39768 0.11544 0.20000) (-0.40305 0.11468 0.20000) (-0.40816 0.11392 0.20000) (-0.41302 0.11316 0.20000) (-0.41764 0.11239 0.20000) (-0.42203 0.11163 0.20000) (-0.42620 0.11087 0.20000) (-0.43017 0.11011 0.20000) (-0.43394 0.10936 0.20000) (-0.43753 0.10861 0.20000) (-0.44094 0.10787 0.20000) (-0.44419 0.10713 0.20000) (-0.44727 0.10639 0.20000) (-0.45020 0.10567 0.20000) (-0.45299 0.10495 0.20000) (-0.45564 0.10423 0.20000) (-0.45815 0.10353 0.20000) (-0.46055 0.10283 0.20000) (-0.46283 0.10214 0.20000) (-0.46499 0.10146 0.20000) (-0.46705 0.10078 0.20000) (-0.46901 0.10011 0.20000) (-0.47087 0.09945 0.20000) (-0.47264 0.09880 0.20000) (-0.47432 0.09815 0.20000) (-0.47592 0.09752 0.20000) (-0.47744 0.09688 0.20000) (-0.47888 0.09626 0.20000) (-0.48026 0.09564 0.20000) (-0.48156 0.09503 0.20000) (-0.48281 0.09443 0.20000) (-0.48399 0.09383 0.20000) (-0.48511 0.09323 0.20000) (-0.48618 0.09264 0.20000) (-0.48719 0.09206 0.20000) (-0.48816 0.09148 0.20000) (-0.48907 0.09090 0.20000) (-0.48995 0.09033 0.20000) (-0.49078 0.08976 0.20000) (-0.49156 0.08919 0.20000) (-0.49231 0.08862 0.20000) (-0.49303 0.08804 0.20000) (-0.49370 0.08747 0.20000) (-0.49435 0.08689 0.20000) (-0.49496 0.08631 0.20000) (-0.49554 0.08572 0.20000) (-0.49610 0.08512 0.20000) (-0.49662 0.08451 0.20000) (-0.49712 0.08388 0.20000) (-0.49760 0.08322 0.20000) (-0.49805 0.08253 0.20000) (-0.49848 0.08178 0.20000) (-0.49889 0.08097 0.20000) (-0.49928 0.08004 0.20000) (-0.49965 0.07886 0.20000) )

    // outer circle
    arc 11  6 45 (0 0 1) // 45 degrees, z-normal
    arc  6  7 45 (0 0 1) // 45 degrees, z-normal
    arc  7  8 45 (0 0 1) // 45 degrees, z-normal
    arc  8 20 45 (0 0 1) // 45 degrees, z-normal
    arc 20 25 45 (0 0 1) // 45 degrees, z-normal
    arc 25 24 45 (0 0 1) // 45 degrees, z-normal
    arc 24 23 45 (0 0 1) // 45 degrees, z-normal
    arc 23 11 45 (0 0 1) // 45 degrees, z-normal
    arc 43 38 45 (0 0 1) // 45 degrees, z-normal
    arc 38 39 45 (0 0 1) // 45 degrees, z-normal
    arc 39 40 45 (0 0 1) // 45 degrees, z-normal
    arc 40 52 45 (0 0 1) // 45 degrees, z-normal
    arc 52 57 45 (0 0 1) // 45 degrees, z-normal
    arc 57 56 45 (0 0 1) // 45 degrees, z-normal
    arc 56 55 45 (0 0 1) // 45 degrees, z-normal
    arc 55 43 45 (0 0 1) // 45 degrees, z-normal
);

// define mesh blocks
blocks
(
    hex ( 0  1  6  5 32 33 38 37) (10 10 1) simpleGrading (1 1 1) // cell #  1
    hex ( 1  2  7  6 33 34 39 38) (10 10 1) simpleGrading (1 1 1) // cell #  2
    hex ( 2  3  8  7 34 35 40 39) (10 10 1) simpleGrading (1 1 1) // cell #  3
    hex (40 41 36 35  8  9  4  3) (10 10 1) simpleGrading (1 1 1) // cell #  4 - flip z
    hex (11 10  5  6 43 42 37 38) (10 40 1) simpleGrading (1 5 1) // cell #  5
    hex (12 11  6 13 44 43 38 45) (10 40 1) simpleGrading (4 5 1) // cell #  6i
    hex (13  6  7 14 45 38 39 46) (10 10 1) simpleGrading (4 1 1) // cell #  7i
    hex (14  7  8 15 46 39 40 47) (10 10 1) simpleGrading (4 1 1) // cell #  8i
    hex (48 52 40 47 16 20  8 15) (10 20 1) simpleGrading (4 5 1) // cell #  9i - flip z
    hex (52 53 41 40 20 21  9  8) (10 20 1) simpleGrading (1 5 1) // cell # 10 - flip z
    hex (43 42 54 55 11 10 22 23) (10 40 1) simpleGrading (1 5 1) // cell # 11  - flip z
    hex (44 43 55 51 12 11 23 19) (10 40 1) simpleGrading (4 5 1) // cell # 12i - flip z
    hex (18 24 23 19 50 56 55 51) (10 10 1) simpleGrading (4 1 1) // cell # 13i
    hex (17 25 24 18 49 57 56 50) (10 10 1) simpleGrading (4 1 1) // cell # 14i
    hex (16 20 25 17 48 52 57 49) (10 20 1) simpleGrading (4 5 1) // cell # 15i
    hex (20 21 26 25 52 53 58 57) (10 20 1) simpleGrading (1 5 1) // cell # 16
    hex (55 54 59 60 23 22 27 28) (10 10 1) simpleGrading (1 1 1) // cell # 17 - flip z
    hex (23 24 29 28 55 56 61 60) (10 10 1) simpleGrading (1 1 1) // cell # 18
    hex (24 25 30 29 56 57 62 61) (10 10 1) simpleGrading (1 1 1) // cell # 19
    hex (25 26 31 30 57 58 63 62) (10 10 1) simpleGrading (1 1 1) // cell # 20  // flip z
);

defaultPatch
{
    name frontAndBack;
    type empty;
}

boundary
(
    inlet
    {
        type patch;
        faces
        (
            ( 5  0 32 37)
            (10  5 37 42)
            (22 10 42 54)
            (27 22 54 59)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            ( 4  9 41 36)
            ( 9 21 53 41)
            (21 26 58 53)
            (26 31 63 58)
        );
    }

    top
    {
        type patch;
        faces
        (
            (28 27 59 60)
            (29 28 60 61)
            (30 29 61 62)
            (31 30 62 63)
        );
    }

    bottom
    {
        type patch;
        faces
        (
            (0 1 33 32)
            (1 2 34 33)
            (2 3 35 34)
            (3 4 36 35)
        );
    }

    upper_foil
    {
        type wall;
        faces
        (
            (12 19 51 44)
            (19 18 50 51)
            (18 17 49 50)
            (17 16 48 49)
        );
    }

    lower_foil
    {
        type wall;
        faces
        (
            (13 12 44 45)
            (14 13 45 46)
            (15 14 46 47)
            (16 15 47 48)
        );
    }
);