day-02/blockMesh/cylinder_in_tank/case/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

// *** Air @ 20C ***
//rho             [1 -3 0 0 0 0 0] 1.2;
//nu              [0 2 -1 0 0 0 0] 1.5e-05; // kinematic viscosity

// *** Water @ 02C***
rho             [1 -3 0 0 0 0 0] 1000;
nu              [0 2 -1 0 0 0 0] 1e-06; // kinematic viscosity

// ************************************************************************* //
